wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/pdma_reg.h
#define PDMA_CHCTL_CHEN11_Pos            (11)                                              /*!< PDMA_T::CHCTL: CHEN11 Position        */
#define PDMA_CHCTL_CHEN11_Msk            (0x1ul << PDMA_CHCTL_CHEN11_Pos)                  /*!< PDMA_T::CHCTL: CHEN11 Mask            */

#define PDMA_CHCTL_CHEN12_Pos            (12)                                              /*!< PDMA_T::CHCTL: CHEN12 Position        */
#define PDMA_CHCTL_CHEN12_Msk            (0x1ul << PDMA_CHCTL_CHEN12_Pos)                  /*!< PDMA_T::CHCTL: CHEN12 Mask            */

#define PDMA_CHCTL_CHEN13_Pos            (13)                                              /*!< PDMA_T::CHCTL: CHEN13 Position        */
#define PDMA_CHCTL_CHEN13_Msk            (0x1ul << PDMA_CHCTL_CHEN13_Pos)                  /*!< PDMA_T::CHCTL: CHEN13 Mask            */

#define PDMA_CHCTL_CHEN14_Pos            (14)                                              /*!< PDMA_T::CHCTL: CHEN14 Position        */
#define PDMA_CHCTL_CHEN14_Msk            (0x1ul << PDMA_CHCTL_CHEN14_Pos)                  /*!< PDMA_T::CHCTL: CHEN14 Mask            */

#define PDMA_CHCTL_CHEN15_Pos            (15)                                              /*!< PDMA_T::CHCTL: CHEN15 Position        */
#define PDMA_CHCTL_CHEN15_Msk            (0x1ul << PDMA_CHCTL_CHEN15_Pos)                  /*!< PDMA_T::CHCTL: CHEN15 Mask            */

#define PDMA_PAUSE_PAUSEn_Pos            (0)                                               /*!< PDMA_T::PAUSE: PAUSEn Position        */
#define PDMA_PAUSE_PAUSEn_Msk            (0xfffful << PDMA_PAUSE_PAUSEn_Pos)               /*!< PDMA_T::PAUSE: PAUSEn Mask            */

#define PDMA_PAUSE_PAUSE0_Pos            (0)                                               /*!< PDMA_T::PAUSE: PAUSE0 Position        */
#define PDMA_PAUSE_PAUSE0_Msk            (0x1ul << PDMA_PAUSE_PAUSE0_Pos)                  /*!< PDMA_T::PAUSE: PAUSE0 Mask            */

#define PDMA_PAUSE_PAUSE1_Pos            (1)                                               /*!< PDMA_T::PAUSE: PAUSE1 Position        */
#define PDMA_PAUSE_PAUSE1_Msk            (0x1ul << PDMA_PAUSE_PAUSE1_Pos)                  /*!< PDMA_T::PAUSE: PAUSE1 Mask            */

#define PDMA_PAUSE_PAUSE2_Pos            (2)                                               /*!< PDMA_T::PAUSE: PAUSE2 Position        */
#define PDMA_PAUSE_PAUSE2_Msk            (0x1ul << PDMA_PAUSE_PAUSE2_Pos)                  /*!< PDMA_T::PAUSE: PAUSE2 Mask            */

#define PDMA_PAUSE_PAUSE3_Pos            (3)                                               /*!< PDMA_T::PAUSE: PAUSE3 Position        */
#define PDMA_PAUSE_PAUSE3_Msk            (0x1ul << PDMA_PAUSE_PAUSE3_Pos)                  /*!< PDMA_T::PAUSE: PAUSE3 Mask            */

#define PDMA_PAUSE_PAUSE4_Pos            (4)                                               /*!< PDMA_T::PAUSE: PAUSE4 Position        */
#define PDMA_PAUSE_PAUSE4_Msk            (0x1ul << PDMA_PAUSE_PAUSE4_Pos)                  /*!< PDMA_T::PAUSE: PAUSE4 Mask            */

#define PDMA_PAUSE_PAUSE5_Pos            (5)                                               /*!< PDMA_T::PAUSE: PAUSE5 Position        */
#define PDMA_PAUSE_PAUSE5_Msk            (0x1ul << PDMA_PAUSE_PAUSE5_Pos)                  /*!< PDMA_T::PAUSE: PAUSE5 Mask            */

#define PDMA_PAUSE_PAUSE6_Pos            (6)                                               /*!< PDMA_T::PAUSE: PAUSE6 Position        */
#define PDMA_PAUSE_PAUSE6_Msk            (0x1ul << PDMA_PAUSE_PAUSE6_Pos)                  /*!< PDMA_T::PAUSE: PAUSE6 Mask            */

#define PDMA_PAUSE_PAUSE7_Pos            (7)                                               /*!< PDMA_T::PAUSE: PAUSE7 Position        */
#define PDMA_PAUSE_PAUSE7_Msk            (0x1ul << PDMA_PAUSE_PAUSE7_Pos)                  /*!< PDMA_T::PAUSE: PAUSE7 Mask            */

#define PDMA_PAUSE_PAUSE8_Pos            (8)                                               /*!< PDMA_T::PAUSE: PAUSE8 Position        */
#define PDMA_PAUSE_PAUSE8_Msk            (0x1ul << PDMA_PAUSE_PAUSE8_Pos)                  /*!< PDMA_T::PAUSE: PAUSE8 Mask            */

#define PDMA_PAUSE_PAUSE9_Pos            (9)                                               /*!< PDMA_T::PAUSE: PAUSE9 Position        */
#define PDMA_PAUSE_PAUSE9_Msk            (0x1ul << PDMA_PAUSE_PAUSE9_Pos)                  /*!< PDMA_T::PAUSE: PAUSE9 Mask            */

#define PDMA_PAUSE_PAUSE10_Pos           (10)                                              /*!< PDMA_T::PAUSE: PAUSE10 Position       */
#define PDMA_PAUSE_PAUSE10_Msk           (0x1ul << PDMA_PAUSE_PAUSE10_Pos)                 /*!< PDMA_T::PAUSE: PAUSE10 Mask           */

#define PDMA_PAUSE_PAUSE11_Pos           (11)                                              /*!< PDMA_T::PAUSE: PAUSE11 Position       */
#define PDMA_PAUSE_PAUSE11_Msk           (0x1ul << PDMA_PAUSE_PAUSE11_Pos)                 /*!< PDMA_T::PAUSE: PAUSE11 Mask           */

#define PDMA_PAUSE_PAUSE12_Pos           (12)                                              /*!< PDMA_T::PAUSE: PAUSE12 Position       */
#define PDMA_PAUSE_PAUSE12_Msk           (0x1ul << PDMA_PAUSE_PAUSE12_Pos)                 /*!< PDMA_T::PAUSE: PAUSE12 Mask           */

#define PDMA_PAUSE_PAUSE13_Pos           (13)                                              /*!< PDMA_T::PAUSE: PAUSE13 Position       */
#define PDMA_PAUSE_PAUSE13_Msk           (0x1ul << PDMA_PAUSE_PAUSE13_Pos)                 /*!< PDMA_T::PAUSE: PAUSE13 Mask           */

#define PDMA_PAUSE_PAUSE14_Pos           (14)                                              /*!< PDMA_T::PAUSE: PAUSE14 Position       */
#define PDMA_PAUSE_PAUSE14_Msk           (0x1ul << PDMA_PAUSE_PAUSE14_Pos)                 /*!< PDMA_T::PAUSE: PAUSE14 Mask           */

#define PDMA_PAUSE_PAUSE15_Pos           (15)                                              /*!< PDMA_T::PAUSE: PAUSE15 Position       */
#define PDMA_PAUSE_PAUSE15_Msk           (0x1ul << PDMA_PAUSE_PAUSE15_Pos)                 /*!< PDMA_T::PAUSE: PAUSE15 Mask           */

#define PDMA_SWREQ_SWREQn_Pos            (0)                                               /*!< PDMA_T::SWREQ: SWREQn Position        */
#define PDMA_SWREQ_SWREQn_Msk            (0xfffful << PDMA_SWREQ_SWREQn_Pos)               /*!< PDMA_T::SWREQ: SWREQn Mask            */

#define PDMA_SWREQ_SWREQ0_Pos            (0)                                               /*!< PDMA_T::SWREQ: SWREQ0 Position        */
#define PDMA_SWREQ_SWREQ0_Msk            (0x1ul << PDMA_SWREQ_SWREQ0_Pos)                  /*!< PDMA_T::SWREQ: SWREQ0 Mask            */

