wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/pdma_reg.h
#define PDMA_PRISET_FPRISET13_Pos        (13)                                              /*!< PDMA_T::PRISET: FPRISET13 Position    */
#define PDMA_PRISET_FPRISET13_Msk        (0x1ul << PDMA_PRISET_FPRISET13_Pos)              /*!< PDMA_T::PRISET: FPRISET13 Mask        */

#define PDMA_PRISET_FPRISET14_Pos        (14)                                              /*!< PDMA_T::PRISET: FPRISET14 Position    */
#define PDMA_PRISET_FPRISET14_Msk        (0x1ul << PDMA_PRISET_FPRISET14_Pos)              /*!< PDMA_T::PRISET: FPRISET14 Mask        */

#define PDMA_PRISET_FPRISET15_Pos        (15)                                              /*!< PDMA_T::PRISET: FPRISET15 Position    */
#define PDMA_PRISET_FPRISET15_Msk        (0x1ul << PDMA_PRISET_FPRISET15_Pos)              /*!< PDMA_T::PRISET: FPRISET15 Mask        */

#define PDMA_PRICLR_FPRICLRn_Pos         (0)                                               /*!< PDMA_T::PRICLR: FPRICLRn Position     */
#define PDMA_PRICLR_FPRICLRn_Msk         (0xfffful << PDMA_PRICLR_FPRICLRn_Pos)            /*!< PDMA_T::PRICLR: FPRICLRn Mask         */

#define PDMA_PRICLR_FPRICLR0_Pos         (0)                                               /*!< PDMA_T::PRICLR: FPRICLR0 Position     */
#define PDMA_PRICLR_FPRICLR0_Msk         (0x1ul << PDMA_PRICLR_FPRICLR0_Pos)               /*!< PDMA_T::PRICLR: FPRICLR0 Mask         */

#define PDMA_PRICLR_FPRICLR1_Pos         (1)                                               /*!< PDMA_T::PRICLR: FPRICLR1 Position     */
#define PDMA_PRICLR_FPRICLR1_Msk         (0x1ul << PDMA_PRICLR_FPRICLR1_Pos)               /*!< PDMA_T::PRICLR: FPRICLR1 Mask         */

#define PDMA_PRICLR_FPRICLR2_Pos         (2)                                               /*!< PDMA_T::PRICLR: FPRICLR2 Position     */
#define PDMA_PRICLR_FPRICLR2_Msk         (0x1ul << PDMA_PRICLR_FPRICLR2_Pos)               /*!< PDMA_T::PRICLR: FPRICLR2 Mask         */

#define PDMA_PRICLR_FPRICLR3_Pos         (3)                                               /*!< PDMA_T::PRICLR: FPRICLR3 Position     */
#define PDMA_PRICLR_FPRICLR3_Msk         (0x1ul << PDMA_PRICLR_FPRICLR3_Pos)               /*!< PDMA_T::PRICLR: FPRICLR3 Mask         */

#define PDMA_PRICLR_FPRICLR4_Pos         (4)                                               /*!< PDMA_T::PRICLR: FPRICLR4 Position     */
#define PDMA_PRICLR_FPRICLR4_Msk         (0x1ul << PDMA_PRICLR_FPRICLR4_Pos)               /*!< PDMA_T::PRICLR: FPRICLR4 Mask         */

#define PDMA_PRICLR_FPRICLR5_Pos         (5)                                               /*!< PDMA_T::PRICLR: FPRICLR5 Position     */
#define PDMA_PRICLR_FPRICLR5_Msk         (0x1ul << PDMA_PRICLR_FPRICLR5_Pos)               /*!< PDMA_T::PRICLR: FPRICLR5 Mask         */

#define PDMA_PRICLR_FPRICLR6_Pos         (6)                                               /*!< PDMA_T::PRICLR: FPRICLR6 Position     */
#define PDMA_PRICLR_FPRICLR6_Msk         (0x1ul << PDMA_PRICLR_FPRICLR6_Pos)               /*!< PDMA_T::PRICLR: FPRICLR6 Mask         */

#define PDMA_PRICLR_FPRICLR7_Pos         (7)                                               /*!< PDMA_T::PRICLR: FPRICLR7 Position     */
#define PDMA_PRICLR_FPRICLR7_Msk         (0x1ul << PDMA_PRICLR_FPRICLR7_Pos)               /*!< PDMA_T::PRICLR: FPRICLR7 Mask         */

#define PDMA_PRICLR_FPRICLR8_Pos         (8)                                               /*!< PDMA_T::PRICLR: FPRICLR8 Position     */
#define PDMA_PRICLR_FPRICLR8_Msk         (0x1ul << PDMA_PRICLR_FPRICLR8_Pos)               /*!< PDMA_T::PRICLR: FPRICLR8 Mask         */

#define PDMA_PRICLR_FPRICLR9_Pos         (9)                                               /*!< PDMA_T::PRICLR: FPRICLR9 Position     */
#define PDMA_PRICLR_FPRICLR9_Msk         (0x1ul << PDMA_PRICLR_FPRICLR9_Pos)               /*!< PDMA_T::PRICLR: FPRICLR9 Mask         */

#define PDMA_PRICLR_FPRICLR10_Pos        (10)                                              /*!< PDMA_T::PRICLR: FPRICLR10 Position    */
#define PDMA_PRICLR_FPRICLR10_Msk        (0x1ul << PDMA_PRICLR_FPRICLR10_Pos)              /*!< PDMA_T::PRICLR: FPRICLR10 Mask        */

#define PDMA_PRICLR_FPRICLR11_Pos        (11)                                              /*!< PDMA_T::PRICLR: FPRICLR11 Position    */
#define PDMA_PRICLR_FPRICLR11_Msk        (0x1ul << PDMA_PRICLR_FPRICLR11_Pos)              /*!< PDMA_T::PRICLR: FPRICLR11 Mask        */

#define PDMA_PRICLR_FPRICLR12_Pos        (12)                                              /*!< PDMA_T::PRICLR: FPRICLR12 Position    */
#define PDMA_PRICLR_FPRICLR12_Msk        (0x1ul << PDMA_PRICLR_FPRICLR12_Pos)              /*!< PDMA_T::PRICLR: FPRICLR12 Mask        */

#define PDMA_PRICLR_FPRICLR13_Pos        (13)                                              /*!< PDMA_T::PRICLR: FPRICLR13 Position    */
#define PDMA_PRICLR_FPRICLR13_Msk        (0x1ul << PDMA_PRICLR_FPRICLR13_Pos)              /*!< PDMA_T::PRICLR: FPRICLR13 Mask        */

#define PDMA_PRICLR_FPRICLR14_Pos        (14)                                              /*!< PDMA_T::PRICLR: FPRICLR14 Position    */
#define PDMA_PRICLR_FPRICLR14_Msk        (0x1ul << PDMA_PRICLR_FPRICLR14_Pos)              /*!< PDMA_T::PRICLR: FPRICLR14 Mask        */

#define PDMA_PRICLR_FPRICLR15_Pos        (15)                                              /*!< PDMA_T::PRICLR: FPRICLR15 Position    */
#define PDMA_PRICLR_FPRICLR15_Msk        (0x1ul << PDMA_PRICLR_FPRICLR15_Pos)              /*!< PDMA_T::PRICLR: FPRICLR15 Mask        */

#define PDMA_INTEN_INTENn_Pos            (0)                                               /*!< PDMA_T::INTEN: INTENn Position        */
#define PDMA_INTEN_INTENn_Msk            (0xfffful << PDMA_INTEN_INTENn_Pos)               /*!< PDMA_T::INTEN: INTENn Mask            */

#define PDMA_INTEN_INTEN0_Pos            (0)                                               /*!< PDMA_T::INTEN: INTEN0 Position        */
#define PDMA_INTEN_INTEN0_Msk            (0x1ul << PDMA_INTEN_INTEN0_Pos)                  /*!< PDMA_T::INTEN: INTEN0 Mask            */

