wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/pdma_reg.h
#define PDMA_TACTSTS_TXACTF4_Pos         (4)                                               /*!< PDMA_T::TACTSTS: TXACTF4 Position     */
#define PDMA_TACTSTS_TXACTF4_Msk         (0x1ul << PDMA_TACTSTS_TXACTF4_Pos)               /*!< PDMA_T::TACTSTS: TXACTF4 Mask         */

#define PDMA_TACTSTS_TXACTF5_Pos         (5)                                               /*!< PDMA_T::TACTSTS: TXACTF5 Position     */
#define PDMA_TACTSTS_TXACTF5_Msk         (0x1ul << PDMA_TACTSTS_TXACTF5_Pos)               /*!< PDMA_T::TACTSTS: TXACTF5 Mask         */

#define PDMA_TACTSTS_TXACTF6_Pos         (6)                                               /*!< PDMA_T::TACTSTS: TXACTF6 Position     */
#define PDMA_TACTSTS_TXACTF6_Msk         (0x1ul << PDMA_TACTSTS_TXACTF6_Pos)               /*!< PDMA_T::TACTSTS: TXACTF6 Mask         */

#define PDMA_TACTSTS_TXACTF7_Pos         (7)                                               /*!< PDMA_T::TACTSTS: TXACTF7 Position     */
#define PDMA_TACTSTS_TXACTF7_Msk         (0x1ul << PDMA_TACTSTS_TXACTF7_Pos)               /*!< PDMA_T::TACTSTS: TXACTF7 Mask         */

#define PDMA_TACTSTS_TXACTF8_Pos         (8)                                               /*!< PDMA_T::TACTSTS: TXACTF8 Position     */
#define PDMA_TACTSTS_TXACTF8_Msk         (0x1ul << PDMA_TACTSTS_TXACTF8_Pos)               /*!< PDMA_T::TACTSTS: TXACTF8 Mask         */

#define PDMA_TACTSTS_TXACTF9_Pos         (9)                                               /*!< PDMA_T::TACTSTS: TXACTF9 Position     */
#define PDMA_TACTSTS_TXACTF9_Msk         (0x1ul << PDMA_TACTSTS_TXACTF9_Pos)               /*!< PDMA_T::TACTSTS: TXACTF9 Mask         */

#define PDMA_TACTSTS_TXACTF10_Pos        (10)                                              /*!< PDMA_T::TACTSTS: TXACTF10 Position    */
#define PDMA_TACTSTS_TXACTF10_Msk        (0x1ul << PDMA_TACTSTS_TXACTF10_Pos)              /*!< PDMA_T::TACTSTS: TXACTF10 Mask        */

#define PDMA_TACTSTS_TXACTF11_Pos        (11)                                              /*!< PDMA_T::TACTSTS: TXACTF11 Position    */
#define PDMA_TACTSTS_TXACTF11_Msk        (0x1ul << PDMA_TACTSTS_TXACTF11_Pos)              /*!< PDMA_T::TACTSTS: TXACTF11 Mask        */

#define PDMA_TACTSTS_TXACTF12_Pos        (12)                                              /*!< PDMA_T::TACTSTS: TXACTF12 Position    */
#define PDMA_TACTSTS_TXACTF12_Msk        (0x1ul << PDMA_TACTSTS_TXACTF12_Pos)              /*!< PDMA_T::TACTSTS: TXACTF12 Mask        */

#define PDMA_TACTSTS_TXACTF13_Pos        (13)                                              /*!< PDMA_T::TACTSTS: TXACTF13 Position    */
#define PDMA_TACTSTS_TXACTF13_Msk        (0x1ul << PDMA_TACTSTS_TXACTF13_Pos)              /*!< PDMA_T::TACTSTS: TXACTF13 Mask        */

#define PDMA_TACTSTS_TXACTF14_Pos        (14)                                              /*!< PDMA_T::TACTSTS: TXACTF14 Position    */
#define PDMA_TACTSTS_TXACTF14_Msk        (0x1ul << PDMA_TACTSTS_TXACTF14_Pos)              /*!< PDMA_T::TACTSTS: TXACTF14 Mask        */

#define PDMA_TACTSTS_TXACTF15_Pos        (15)                                              /*!< PDMA_T::TACTSTS: TXACTF15 Position    */
#define PDMA_TACTSTS_TXACTF15_Msk        (0x1ul << PDMA_TACTSTS_TXACTF15_Pos)              /*!< PDMA_T::TACTSTS: TXACTF15 Mask        */

#define PDMA_TOUTPSC0_7_TOUTPSC0_Pos     (0)                                               /*!< PDMA_T::TOUTPSC0_7: TOUTPSC0 Position */
#define PDMA_TOUTPSC0_7_TOUTPSC0_Msk     (0x7ul << PDMA_TOUTPSC0_7_TOUTPSC0_Pos)           /*!< PDMA_T::TOUTPSC0_7: TOUTPSC0 Mask     */

#define PDMA_TOUTPSC0_7_TOUTPSC1_Pos     (4)                                               /*!< PDMA_T::TOUTPSC0_7: TOUTPSC1 Position */
#define PDMA_TOUTPSC0_7_TOUTPSC1_Msk     (0x7ul << PDMA_TOUTPSC0_7_TOUTPSC1_Pos)           /*!< PDMA_T::TOUTPSC0_7: TOUTPSC1 Mask     */

#define PDMA_TOUTPSC0_7_TOUTPSC2_Pos     (8)                                               /*!< PDMA_T::TOUTPSC0_7: TOUTPSC2 Position */
#define PDMA_TOUTPSC0_7_TOUTPSC2_Msk     (0x7ul << PDMA_TOUTPSC0_7_TOUTPSC2_Pos)           /*!< PDMA_T::TOUTPSC0_7: TOUTPSC2 Mask     */

#define PDMA_TOUTPSC0_7_TOUTPSC3_Pos     (12)                                              /*!< PDMA_T::TOUTPSC0_7: TOUTPSC3 Position */
#define PDMA_TOUTPSC0_7_TOUTPSC3_Msk     (0x7ul << PDMA_TOUTPSC0_7_TOUTPSC3_Pos)           /*!< PDMA_T::TOUTPSC0_7: TOUTPSC3 Mask     */

#define PDMA_TOUTPSC0_7_TOUTPSC4_Pos     (16)                                              /*!< PDMA_T::TOUTPSC0_7: TOUTPSC4 Position */
#define PDMA_TOUTPSC0_7_TOUTPSC4_Msk     (0x7ul << PDMA_TOUTPSC0_7_TOUTPSC4_Pos)           /*!< PDMA_T::TOUTPSC0_7: TOUTPSC4 Mask     */

#define PDMA_TOUTPSC0_7_TOUTPSC5_Pos     (20)                                              /*!< PDMA_T::TOUTPSC0_7: TOUTPSC5 Position */
#define PDMA_TOUTPSC0_7_TOUTPSC5_Msk     (0x7ul << PDMA_TOUTPSC0_7_TOUTPSC5_Pos)           /*!< PDMA_T::TOUTPSC0_7: TOUTPSC5 Mask     */

#define PDMA_TOUTPSC0_7_TOUTPSC6_Pos     (24)                                              /*!< PDMA_T::TOUTPSC0_7: TOUTPSC6 Position */
#define PDMA_TOUTPSC0_7_TOUTPSC6_Msk     (0x7ul << PDMA_TOUTPSC0_7_TOUTPSC6_Pos)           /*!< PDMA_T::TOUTPSC0_7: TOUTPSC6 Mask     */

#define PDMA_TOUTPSC0_7_TOUTPSC7_Pos     (28)                                              /*!< PDMA_T::TOUTPSC0_7: TOUTPSC7 Position */
#define PDMA_TOUTPSC0_7_TOUTPSC7_Msk     (0x7ul << PDMA_TOUTPSC0_7_TOUTPSC7_Pos)           /*!< PDMA_T::TOUTPSC0_7: TOUTPSC7 Mask     */

#define PDMA_TOUTEN_TOUTENn_Pos          (0)                                               /*!< PDMA_T::TOUTEN: TOUTENn Position      */
#define PDMA_TOUTEN_TOUTENn_Msk          (0xfffful << PDMA_TOUTEN_TOUTENn_Pos)             /*!< PDMA_T::TOUTEN: TOUTENn Mask          */

#define PDMA_TOUTEN_TOUTEN0_Pos          (0)                                               /*!< PDMA_T::TOUTEN: TOUTEN0 Position      */
#define PDMA_TOUTEN_TOUTEN0_Msk          (0x1ul << PDMA_TOUTEN_TOUTEN0_Pos)                /*!< PDMA_T::TOUTEN: TOUTEN0 Mask          */

