wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/pdma_reg.h
#define PDMA_TOUTIEN_TOUTIEN9_Pos        (9)                                               /*!< PDMA_T::TOUTIEN: TOUTIEN9 Position    */
#define PDMA_TOUTIEN_TOUTIEN9_Msk        (0x1ul << PDMA_TOUTIEN_TOUTIEN9_Pos)              /*!< PDMA_T::TOUTIEN: TOUTIEN9 Mask        */

#define PDMA_TOUTIEN_TOUTIEN10_Pos       (10)                                              /*!< PDMA_T::TOUTIEN: TOUTIEN10 Position   */
#define PDMA_TOUTIEN_TOUTIEN10_Msk       (0x1ul << PDMA_TOUTIEN_TOUTIEN10_Pos)             /*!< PDMA_T::TOUTIEN: TOUTIEN10 Mask       */

#define PDMA_TOUTIEN_TOUTIEN11_Pos       (11)                                              /*!< PDMA_T::TOUTIEN: TOUTIEN11 Position   */
#define PDMA_TOUTIEN_TOUTIEN11_Msk       (0x1ul << PDMA_TOUTIEN_TOUTIEN11_Pos)             /*!< PDMA_T::TOUTIEN: TOUTIEN11 Mask       */

#define PDMA_TOUTIEN_TOUTIEN12_Pos       (12)                                              /*!< PDMA_T::TOUTIEN: TOUTIEN12 Position   */
#define PDMA_TOUTIEN_TOUTIEN12_Msk       (0x1ul << PDMA_TOUTIEN_TOUTIEN12_Pos)             /*!< PDMA_T::TOUTIEN: TOUTIEN12 Mask       */

#define PDMA_TOUTIEN_TOUTIEN13_Pos       (13)                                              /*!< PDMA_T::TOUTIEN: TOUTIEN13 Position   */
#define PDMA_TOUTIEN_TOUTIEN13_Msk       (0x1ul << PDMA_TOUTIEN_TOUTIEN13_Pos)             /*!< PDMA_T::TOUTIEN: TOUTIEN13 Mask       */

#define PDMA_TOUTIEN_TOUTIEN14_Pos       (14)                                              /*!< PDMA_T::TOUTIEN: TOUTIEN14 Position   */
#define PDMA_TOUTIEN_TOUTIEN14_Msk       (0x1ul << PDMA_TOUTIEN_TOUTIEN14_Pos)             /*!< PDMA_T::TOUTIEN: TOUTIEN14 Mask       */

#define PDMA_TOUTIEN_TOUTIEN15_Pos       (15)                                              /*!< PDMA_T::TOUTIEN: TOUTIEN15 Position   */
#define PDMA_TOUTIEN_TOUTIEN15_Msk       (0x1ul << PDMA_TOUTIEN_TOUTIEN15_Pos)             /*!< PDMA_T::TOUTIEN: TOUTIEN15 Mask       */

#define PDMA_TOC0_1_TOC0_Pos             (0)                                               /*!< PDMA_T::TOC0_1: TOC0 Position         */
#define PDMA_TOC0_1_TOC0_Msk             (0xfffful << PDMA_TOC0_1_TOC0_Pos)                /*!< PDMA_T::TOC0_1: TOC0 Mask             */

#define PDMA_TOC0_1_TOC1_Pos             (16)                                              /*!< PDMA_T::TOC0_1: TOC1 Position         */
#define PDMA_TOC0_1_TOC1_Msk             (0xfffful << PDMA_TOC0_1_TOC1_Pos)                /*!< PDMA_T::TOC0_1: TOC1 Mask             */

#define PDMA_TOC2_3_TOC2_Pos             (0)                                               /*!< PDMA_T::TOC2_3: TOC2 Position         */
#define PDMA_TOC2_3_TOC2_Msk             (0xfffful << PDMA_TOC2_3_TOC2_Pos)                /*!< PDMA_T::TOC2_3: TOC2 Mask             */

#define PDMA_TOC2_3_TOC3_Pos             (16)                                              /*!< PDMA_T::TOC2_3: TOC3 Position         */
#define PDMA_TOC2_3_TOC3_Msk             (0xfffful << PDMA_TOC2_3_TOC3_Pos)                /*!< PDMA_T::TOC2_3: TOC3 Mask             */

#define PDMA_TOC4_5_TOC4_Pos             (0)                                               /*!< PDMA_T::TOC4_5: TOC4 Position         */
#define PDMA_TOC4_5_TOC4_Msk             (0xfffful << PDMA_TOC4_5_TOC4_Pos)                /*!< PDMA_T::TOC4_5: TOC4 Mask             */

#define PDMA_TOC4_5_TOC5_Pos             (16)                                              /*!< PDMA_T::TOC4_5: TOC5 Position         */
#define PDMA_TOC4_5_TOC5_Msk             (0xfffful << PDMA_TOC4_5_TOC5_Pos)                /*!< PDMA_T::TOC4_5: TOC5 Mask             */

#define PDMA_TOC6_7_TOC6_Pos             (0)                                               /*!< PDMA_T::TOC6_7: TOC6 Position         */
#define PDMA_TOC6_7_TOC6_Msk             (0xfffful << PDMA_TOC6_7_TOC6_Pos)                /*!< PDMA_T::TOC6_7: TOC6 Mask             */

#define PDMA_TOC6_7_TOC7_Pos             (16)                                              /*!< PDMA_T::TOC6_7: TOC7 Position         */
#define PDMA_TOC6_7_TOC7_Msk             (0xfffful << PDMA_TOC6_7_TOC7_Pos)                /*!< PDMA_T::TOC6_7: TOC7 Mask             */

#define PDMA_TOC8_9_TOC8_Pos             (0)                                               /*!< PDMA_T::TOC8_9: TOC8 Position         */
#define PDMA_TOC8_9_TOC8_Msk             (0xfffful << PDMA_TOC8_9_TOC8_Pos)                /*!< PDMA_T::TOC8_9: TOC8 Mask             */

#define PDMA_TOC8_9_TOC9_Pos             (16)                                              /*!< PDMA_T::TOC8_9: TOC9 Position         */
#define PDMA_TOC8_9_TOC9_Msk             (0xfffful << PDMA_TOC8_9_TOC9_Pos)                /*!< PDMA_T::TOC8_9: TOC9 Mask             */

#define PDMA_TOC10_11_TOC10_Pos          (0)                                               /*!< PDMA_T::TOC10_11: TOC10 Position      */
#define PDMA_TOC10_11_TOC10_Msk          (0xfffful << PDMA_TOC10_11_TOC10_Pos)             /*!< PDMA_T::TOC10_11: TOC10 Mask          */

#define PDMA_TOC10_11_TOC11_Pos          (16)                                              /*!< PDMA_T::TOC10_11: TOC11 Position      */
#define PDMA_TOC10_11_TOC11_Msk          (0xfffful << PDMA_TOC10_11_TOC11_Pos)             /*!< PDMA_T::TOC10_11: TOC11 Mask          */

#define PDMA_TOC12_13_TOC12_Pos          (0)                                               /*!< PDMA_T::TOC12_13: TOC12 Position      */
#define PDMA_TOC12_13_TOC12_Msk          (0xfffful << PDMA_TOC12_13_TOC12_Pos)             /*!< PDMA_T::TOC12_13: TOC12 Mask          */

#define PDMA_TOC12_13_TOC13_Pos          (16)                                              /*!< PDMA_T::TOC12_13: TOC13 Position      */
#define PDMA_TOC12_13_TOC13_Msk          (0xfffful << PDMA_TOC12_13_TOC13_Pos)             /*!< PDMA_T::TOC12_13: TOC13 Mask          */

#define PDMA_TOC14_15_TOC14_Pos          (0)                                               /*!< PDMA_T::TOC14_15: TOC14 Position      */
#define PDMA_TOC14_15_TOC14_Msk          (0xfffful << PDMA_TOC14_15_TOC14_Pos)             /*!< PDMA_T::TOC14_15: TOC14 Mask          */

#define PDMA_TOC14_15_TOC15_Pos          (16)                                              /*!< PDMA_T::TOC14_15: TOC15 Position      */
#define PDMA_TOC14_15_TOC15_Msk          (0xfffful << PDMA_TOC14_15_TOC15_Pos)             /*!< PDMA_T::TOC14_15: TOC15 Mask          */

#define PDMA_CHRST_CHnRST_Pos            (0)                                               /*!< PDMA_T::CHRST: CHnRST Position        */
#define PDMA_CHRST_CHnRST_Msk            (0xfffful << PDMA_CHRST_CHnRST_Pos)               /*!< PDMA_T::CHRST: CHnRST Mask            */

#define PDMA_CHRST_CH0RST_Pos            (0)                                               /*!< PDMA_T::CHRST: CH0RST Position        */
#define PDMA_CHRST_CH0RST_Msk            (0x1ul << PDMA_CHRST_CH0RST_Pos)                  /*!< PDMA_T::CHRST: CH0RST Mask            */

#define PDMA_CHRST_CH1RST_Pos            (1)                                               /*!< PDMA_T::CHRST: CH1RST Position        */
#define PDMA_CHRST_CH1RST_Msk            (0x1ul << PDMA_CHRST_CH1RST_Pos)                  /*!< PDMA_T::CHRST: CH1RST Mask            */

#define PDMA_CHRST_CH2RST_Pos            (2)                                               /*!< PDMA_T::CHRST: CH2RST Position        */
#define PDMA_CHRST_CH2RST_Msk            (0x1ul << PDMA_CHRST_CH2RST_Pos)                  /*!< PDMA_T::CHRST: CH2RST Mask            */

#define PDMA_CHRST_CH3RST_Pos            (3)                                               /*!< PDMA_T::CHRST: CH3RST Position        */
#define PDMA_CHRST_CH3RST_Msk            (0x1ul << PDMA_CHRST_CH3RST_Pos)                  /*!< PDMA_T::CHRST: CH3RST Mask            */

#define PDMA_CHRST_CH4RST_Pos            (4)                                               /*!< PDMA_T::CHRST: CH4RST Position        */
#define PDMA_CHRST_CH4RST_Msk            (0x1ul << PDMA_CHRST_CH4RST_Pos)                  /*!< PDMA_T::CHRST: CH4RST Mask            */

#define PDMA_CHRST_CH5RST_Pos            (5)                                               /*!< PDMA_T::CHRST: CH5RST Position        */
#define PDMA_CHRST_CH5RST_Msk            (0x1ul << PDMA_CHRST_CH5RST_Pos)                  /*!< PDMA_T::CHRST: CH5RST Mask            */

#define PDMA_CHRST_CH6RST_Pos            (6)                                               /*!< PDMA_T::CHRST: CH6RST Position        */
#define PDMA_CHRST_CH6RST_Msk            (0x1ul << PDMA_CHRST_CH6RST_Pos)                  /*!< PDMA_T::CHRST: CH6RST Mask            */

#define PDMA_CHRST_CH7RST_Pos            (7)                                               /*!< PDMA_T::CHRST: CH7RST Position        */
#define PDMA_CHRST_CH7RST_Msk            (0x1ul << PDMA_CHRST_CH7RST_Pos)                  /*!< PDMA_T::CHRST: CH7RST Mask            */

#define PDMA_CHRST_CH8RST_Pos            (8)                                               /*!< PDMA_T::CHRST: CH8RST Position        */
#define PDMA_CHRST_CH8RST_Msk            (0x1ul << PDMA_CHRST_CH8RST_Pos)                  /*!< PDMA_T::CHRST: CH8RST Mask            */

#define PDMA_CHRST_CH9RST_Pos            (9)                                               /*!< PDMA_T::CHRST: CH9RST Position        */
#define PDMA_CHRST_CH9RST_Msk            (0x1ul << PDMA_CHRST_CH9RST_Pos)                  /*!< PDMA_T::CHRST: CH9RST Mask            */

#define PDMA_CHRST_CH10RST_Pos           (10)                                              /*!< PDMA_T::CHRST: CH10RST Position       */
#define PDMA_CHRST_CH10RST_Msk           (0x1ul << PDMA_CHRST_CH10RST_Pos)                 /*!< PDMA_T::CHRST: CH10RST Mask           */

#define PDMA_CHRST_CH11RST_Pos           (11)                                              /*!< PDMA_T::CHRST: CH11RST Position       */
#define PDMA_CHRST_CH11RST_Msk           (0x1ul << PDMA_CHRST_CH11RST_Pos)                 /*!< PDMA_T::CHRST: CH11RST Mask           */

